# 1. Создать класс TrafficLight (светофор).
# определить у него один атрибут color (цвет) и метод running (запуск);
# атрибут реализовать как приватный;
# в рамках метода реализовать переключение светофора в режимы: красный, жёлтый, зелёный;
# продолжительность первого состояния (красный) составляет 7 секунд, второго (жёлтый) — 2 секунды,
# третьего (зелёный) — на ваше усмотрение;
# переключение между режимами должно осуществляться только в указанном порядке (красный, жёлтый, зелёный);
# проверить работу примера, создав экземпляр и вызвав описанный метод.

from time import sleep


class TrafficLight:

    __states = {'red': 7,
                'yellow': 2,
                'green': 5
                }
    __color = None

    @staticmethod
    def running():
        for color, states in TrafficLight.__states.items():
            TrafficLight.__color = color
            print(TrafficLight.__color)
            sleep(states)


my_traffic = TrafficLight()
my_traffic.running()
